jimmywong2003/SES-Project-For-NRF51/ble_peripheral_nrf51822/ble_app_uart/main.c
        *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}

/**
 * @brief TIMER interrupt handler.
 */
void timer_handler(nrf_timer_event_t event_type, void* p_context)
{
}

/**
 * @brief ADC interrupt handler.
 * Prints ADC results on hardware UART and over BLE via the NUS service.
 */
static void adc_event_handler(nrf_drv_adc_evt_t const * p_event)
{
        uint8_t adc_result[ADC_BUFFER_SIZE*2];

        if (p_event->type == NRF_DRV_ADC_EVT_DONE)
        {
                adc_event_counter++;
                printf("  adc event counter: %d\r\n", adc_event_counter);
                for (uint32_t i = 0; i < p_event->data.done.size; i++)
                {
                        printf("ADC value channel %d: %d\r\n", (int)(i % number_of_adc_channels), p_event->data.done.p_buffer[i]);
                        adc_result[(i*2)] = p_event->data.done.p_buffer[i] >> 8;
                        adc_result[(i*2)+1] = p_event->data.done.p_buffer[i];
                }
                if(ADC_BUFFER_SIZE <= 10)
                {
                        ble_nus_string_send(&m_nus, &adc_result[0], ADC_BUFFER_SIZE*2);
                }
                APP_ERROR_CHECK(nrf_drv_adc_buffer_convert(adc_buffer,ADC_BUFFER_SIZE));
                LEDS_INVERT(BSP_LED_3_MASK);
        }
}

void adc_sampling_event_enable(void)
{
        ret_code_t err_code = nrf_drv_ppi_channel_enable(m_ppi_channel);
        APP_ERROR_CHECK(err_code);
}

void adc_sampling_event_disable(void)
{
        ret_code_t err_code = nrf_drv_ppi_channel_disable(m_ppi_channel);
        APP_ERROR_CHECK(err_code);
}

/*@brief ADC initialization.
 */
static void adc_config(void)
{
        ret_code_t ret_code;

        //Initialize ADC
        nrf_drv_adc_config_t config = NRF_DRV_ADC_DEFAULT_CONFIG;
        ret_code = nrf_drv_adc_init(&config, adc_event_handler);
        APP_ERROR_CHECK(ret_code);

        //Configure and enable ADC channel 0
        static nrf_drv_adc_channel_t m_channel_0_config = NRF_DRV_ADC_DEFAULT_CHANNEL(NRF_ADC_CONFIG_INPUT_2);
        m_channel_0_config.config.config.input = NRF_ADC_CONFIG_SCALING_INPUT_ONE_THIRD;
        nrf_drv_adc_channel_enable(&m_channel_0_config);

        //Configure and enable ADC channel 1
        static nrf_drv_adc_channel_t m_channel_1_config = NRF_DRV_ADC_DEFAULT_CHANNEL(NRF_ADC_CONFIG_INPUT_6);
        m_channel_1_config.config.config.input = NRF_ADC_CONFIG_SCALING_INPUT_ONE_THIRD;
        nrf_drv_adc_channel_enable(&m_channel_1_config);

        //Configure and enable ADC channel 2
        static nrf_drv_adc_channel_t m_channel_2_config = NRF_DRV_ADC_DEFAULT_CHANNEL(NRF_ADC_CONFIG_INPUT_7);
        m_channel_2_config.config.config.input = NRF_ADC_CONFIG_SCALING_INPUT_ONE_THIRD;
        nrf_drv_adc_channel_enable(&m_channel_2_config);

        number_of_adc_channels = 3; //Set equal to the number of configured ADC channels, for the sake of UART output.
}

/**
 * @brief Setup sampling events.
 */
void adc_sampling_event_init(void)
{
        ret_code_t err_code;
        err_code = nrf_drv_ppi_init();
        APP_ERROR_CHECK(err_code);

        nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
        err_code = nrf_drv_timer_init(&m_timer, &timer_cfg, timer_handler);
        APP_ERROR_CHECK(err_code);

        /* setup m_timer for compare event */
        uint32_t time_ticks = nrf_drv_timer_ms_to_ticks(&m_timer, ADC_SAMPLE_RATE);
        nrf_drv_timer_extended_compare(&m_timer, NRF_TIMER_CC_CHANNEL0, time_ticks, NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true);
        nrf_drv_timer_enable(&m_timer);

        uint32_t timer_compare_event_addr = nrf_drv_timer_compare_event_address_get(&m_timer, NRF_TIMER_CC_CHANNEL0);
        uint32_t adc_sample_event_addr = nrf_drv_adc_start_task_get();

        /* setup ppi channel so that timer compare event is triggering sample task in SAADC */
        err_code = nrf_drv_ppi_channel_alloc(&m_ppi_channel);
        APP_ERROR_CHECK(err_code);

        err_code = nrf_drv_ppi_channel_assign(m_ppi_channel, timer_compare_event_addr, adc_sample_event_addr); //NRF_ADC->TASKS_START);
        APP_ERROR_CHECK(err_code);
}

/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
        uint32_t err_code = sd_app_evt_wait();
        APP_ERROR_CHECK(err_code);
}


/**@brief Application main function.
 */
int main(void)
{
        uint32_t err_code;
        bool erase_bonds;

        // Initialize.
        uart_init();

        timers_init();
        buttons_leds_init(&erase_bonds);
        ble_stack_init();
        scheduler_init();
        gap_params_init();
        services_init();
        advertising_init();
        conn_params_init();

        timers_start();
        printf("\r\SM SDK 12.3 example nUART Start!\r\n");
        err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
        APP_ERROR_CHECK(err_code);


        adc_sampling_event_init();
        adc_config();
        APP_ERROR_CHECK(nrf_drv_adc_buffer_convert(adc_buffer,ADC_BUFFER_SIZE));
        adc_sampling_event_enable();

        // Enter main loop.
        for (;;)
        {
                app_sched_execute();
                if (NRF_LOG_PROCESS() == false)
                {
                        power_manage();
                }
        }
}


/**
 * @}
 */
